# Baby Name Analysis
Demonstrate the analysis of US baby name data collected every year for the nation and by state.

## Introduction

A Jupyter notebook to explore baby names (names, by year, by gender, by state) as a basis to learn more about data preparation, data visualization, and data analysis using Python, Pandas, matplotlib and iPython (Jupyter) notebooks

##### Author:
Douglas Moore
@douglas_ma

## Install
This workbook is based on https://github.com/dmoore247/jupyterlab plus these packages:

In [1]:
%%sh
conda install --yes -c conda-forge matplotlib pandas scipy

Solving environment: ...working... done

# All requested packages already installed.

In [2]:
# Tell Jupyter to inline plots
%matplotlib inline

In [3]:
# Verify data file
# SQLLite database downloaded from: https://www.kaggle.com/kaggle/us-baby-names
database='/data/babynames/database.sqlite'
%env database database
%ls  $database

env: database=database
/data/babynames/database.sqlite

In [4]:
# imports
%matplotlib inline
import warnings
warnings.filterwarnings("ignore", message="axes.color_cycle is deprecated")
import numpy as np
import pandas as pd
import scipy as sp
# import seaborn as sns
import sqlite3
import matplotlib.pyplot as plt

In [5]:
# explore sqlite contents using sqlite3. A minimally sql compliant data store.
con = sqlite3.connect( database )
cursor = con.cursor()

In [6]:
# list table names
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
print(cursor.fetchall())

[('NationalNames',), ('StateNames',)]

In [7]:
# helper method to load the data
def load(what='NationalNames'):
    df = pd.read_sql_query("SELECT Name, Year, Gender, Count FROM NationalNames WHERE Year >= 1950",con)
    return df

In [8]:
# Actually load the data from the datafile
df = load(what='NationalNames')
df.tail(5) #sample last 5 names

            Name  Year Gender  Count
1363507   Zykeem  2014      M      5
1363508   Zymeer  2014      M      5
1363509  Zymiere  2014      M      5
1363510    Zyran  2014      M      5
1363511    Zyrin  2014      M      5

In [9]:
df = df[['Name','Count','Year','Gender']].groupby(['Name','Gender'])
df.head(5)

              Name  Count  Year Gender
0            Linda  80431  1950      F
1             Mary  65460  1950      F
2         Patricia  47945  1950      F
3          Barbara  41558  1950      F
4            Susan  38022  1950      F
5            Nancy  29621  1950      F
6          Deborah  29071  1950      F
7           Sandra  28893  1950      F
8            Carol  26159  1950      F
9         Kathleen  25699  1950      F
10          Sharon  24611  1950      F
11           Karen  24139  1950      F
12           Donna  21630  1950      F
13          Brenda  20793  1950      F
14        Margaret  18102  1950      F
15           Diane  17632  1950      F
16          Pamela  16200  1950      F
17           Janet  16192  1950      F
18         Shirley  15893  1950      F
19         Carolyn  15597  1950      F
20          Judith  15359  1950      F
21          Janice  15018  1950      F
22         Cynthia  14449  1950      F
23       Elizabeth  14343  1950      F
24            Judy  14206  1950      F
25           Betty  13615  1950      F
26           Joyce  13417  1950      F
27       Christine  12676  1950      F
28          Cheryl  11823  1950      F
29          Gloria  11033  1950      F
...            ...    ...   ...    ...
1363470      Zarak      5  2014      M
1363471      Zaryn      5  2014      M
1363473    Zaydren      5  2014      M
1363474      Zayid      5  2014      M
1363476    Zaymere      5  2014      M
1363478    Zaysean      5  2014      M
1363480      Zedan      5  2014      M
1363481      Zedek      5  2014      M
1363484     Zeidan      5  2014      M
1363485   Zekeriah      5  2014      M
1363487     Zephen      5  2014      M
1363489    Zhaiden      5  2014      M
1363490     Zhalen      5  2014      M
1363491    Zhayden      5  2014      M
1363492       Ziar      5  2014      M
1363493     Zichen      5  2014      M
1363494      Ziden      5  2014      M
1363496      Ziion      5  2014      M
1363497      Zijun      5  2014      M
1363498      Zilas      5  2014      M
1363499      Zirui      5  2014      M
1363500      Zivon      5  2014      M
1363501      Ziyah      5  2014      M
1363502     Ziyang      5  2014      M
1363503    Zmarion      5  2014      M
1363504         Zo      5  2014      M
1363506       Zyel      5  2014      M
1363508     Zymeer      5  2014      M
1363510      Zyran      5  2014      M
1363511      Zyrin      5  2014      M

[352853 rows x 4 columns]

In [10]:
# keep only rows with series length 65 years and with enough babies.
df = df.filter(lambda x: len(x) == 65 and sum(x.Count) > 5000)

In [11]:
df.head(10)

       Name  Count  Year Gender
0     Linda  80431  1950      F
1      Mary  65460  1950      F
2  Patricia  47945  1950      F
3   Barbara  41558  1950      F
4     Susan  38022  1950      F
5     Nancy  29621  1950      F
6   Deborah  29071  1950      F
7    Sandra  28893  1950      F
8     Carol  26159  1950      F
9  Kathleen  25699  1950      F

In [12]:
print type(df)
df.describe()

SyntaxError: invalid syntax (<ipython-input-12-1336746c71ed>, line 1)

In [ ]:
# https://github.com/JosPolfliet/pandas-profiling
import pandas_profiling

In [ ]:
pandas_profiling.ProfileReport(df)
profile = pandas_profiling.ProfileReport(df)
profile.to_file(outputfile="babynames-profile.html")

In [ ]:
%ls -alt baby*

In [ ]:
# top ten names across full history
glob_freq = (df.groupby('Name')
             .agg({'Count': 'sum'})
             .sort_values('Count', ascending=False))

In [ ]:
# bar chart
glob_freq[['Count']].head(10).plot(kind='bar')

In [ ]:
# plot timeseries for Danielle
y1 = df.query('Name=="Danielle"')[['Year', 'Name', 'Count']].groupby('Year').sum()
y1.plot()

In [ ]:
y2 = df.query('Name=="Daniel"')[['Year', 'Name', 'Count']].groupby('Year').sum()
y2.plot()

In [ ]:
# start cross correlation analysis

In [ ]:
table = df.pivot_table(index='Year', columns=['Name','Gender'], values='Count').fillna(0)

In [ ]:
table.head(10)

In [ ]:
# run cross correlation of one name series against every other. This is memory intensive.
# this will produce a symetric matrix
xc = table.corr()

In [ ]:
xc.head(10)

In [ ]:
# Profile the data set
xc.describe()

In [ ]:
# filter out bad matches, with correlation <= 0.8
xc1 = xc.applymap(lambda x: x if x > 0.8 else np.nan)

In [ ]:
xc1.head(10)

In [ ]:
# filter out lower triangle (correlation matrix is symetric)
xc2 = xc1.mask(np.tril(np.ones(xc.shape)).astype(np.bool))

In [ ]:
xc2.head(20)

In [ ]:
# turn correlation matrix into a lengthy table with (from name, from gender, to name, to gender), drop the NaN rows
s = xc2.unstack(level=0).unstack().dropna()

In [ ]:
# create sorted series in descending order of correlation
so = s.sort_values(ascending=False)

In [ ]:
# display to 10 items
so.head(10)

### Get the top two most similar timeseries

In [ ]:
# get the top two most similar timeseries
index=0 # top name pair
names = (so.index[index][0], so.index[index][2])
f1 = 'Name=="' + names[0] + '"'
f2 = 'Name=="' + names[1] + '"'
print names, f1, f2
y1 = df.query(f1)[['Year', 'Count']].groupby('Year').sum()
y2 = df.query(f2)[['Year', 'Count']].groupby('Year').sum()

### Plot the name plots side by side for comparison's sake

In [ ]:
#Plot the two time series
size=15
fig, ax = plt.subplots(2, 1, sharex='col', figsize=(size, size*.7))

plt.subplot(2,1,1)
plt.plot(y1.unstack())
plt.title(so.index[index][0])
plt.subplot(2,1,2)
plt.plot(y2.unstack())
plt.title(so.index[index][2])
plt.show()

### Cross correlation between name1 and name2

In [ ]:
plt.plot(y1.unstack(),y2.unstack())
plt.title('Name 1 vs. Name 2')